Revit 2024 API
BuiltInFailures.SteelElementFailures.SteelElementPropagationTaskNotFinished Property
 Advance Steel propagation tasks not finished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementPropagationTaskNotFinished { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementPropagationTaskNotFinished As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementPropagationTaskNotFinished {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace